swiftat-itwfeg/UnifiedGTXproRT1024/docs/design/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* Define the flexspi macro. Note that it can't be modified here */
#define IOMUXC_GPIO_AD_B1_00_FLEXSPI_A_DATA03 0x401F80FCU, 0x1U, 0x401F8374U, 0x1U, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_01_FLEXSPI_A_SCLK 0x401F8100U, 0x1U, 0x401F8378U, 0x1U, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_02_FLEXSPI_A_DATA00 0x401F8104U, 0x1U, 0x401F8368U, 0x1U, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_03_FLEXSPI_A_DATA02 0x401F8108U, 0x1U, 0x401F8370U, 0x1U, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_04_FLEXSPI_A_DATA01 0x401F810CU, 0x1U, 0x401F836CU, 0x1U, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_05_FLEXSPI_A_SS0_B 0x401F8110U, 0x1U, 0, 0, 0x401F8284U

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_12 (number 96), Shoot Through */
#define BOARD_INITPINS_SHOOT_THROUGH_PERIPHERAL                             ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_SHOOT_THROUGH_SIGNAL                                   IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_SHOOT_THROUGH_CHANNEL                                  0U   /*!< ADC1 IN channel: 0 */

/* GPIO_AD_B0_14 (number 94), Print Head Voltage */
#define BOARD_INITPINS_PRINT_HEAD_VOLTAGE_PERIPHERAL                        ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_PRINT_HEAD_VOLTAGE_SIGNAL                              IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_PRINT_HEAD_VOLTAGE_CHANNEL                             1U   /*!< ADC1 IN channel: 1 */

/* GPIO_AD_B0_15 (number 93), Print Head Thermal */
#define BOARD_INITPINS_PRINT_HEAD_THERMAL_PERIPHERAL                        ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_PRINT_HEAD_THERMAL_SIGNAL                              IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_PRINT_HEAD_THERMAL_CHANNEL                             2U   /*!< ADC1 IN channel: 2 */

/* GPIO_AD_B1_06 (number 84), Media Sensor */
#define BOARD_INITPINS_MEDIA_SENSOR_PERIPHERAL                              ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_MEDIA_SENSOR_SIGNAL                                    IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_MEDIA_SENSOR_CHANNEL                                   6U   /*!< ADC1 IN channel: 6 */

/* GPIO_AD_B1_07 (number 83), Model Type */
#define BOARD_INITPINS_MODEL_TYPE_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_MODEL_TYPE_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_MODEL_TYPE_CHANNEL                                     7U   /*!< ADC1 IN channel: 7 */

/* GPIO_AD_B1_08 (number 82), Dot Wear */
#define BOARD_INITPINS_DOT_WEAR_PERIPHERAL                                  ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_DOT_WEAR_SIGNAL                                        IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_DOT_WEAR_CHANNEL                                       8U   /*!< ADC1 IN channel: 8 */

/* GPIO_AD_B1_09 (number 81), Head Up */
#define BOARD_INITPINS_HEADUP_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_HEADUP_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_HEADUP_CHANNEL                                         9U   /*!< ADC1 IN channel: 9 */

/* GPIO_AD_B0_02 (number 109), Jtag Mod */
#define BOARD_INITPINS_JTAG_MOD_PERIPHERAL                                  JTAG   /*!< Device name: JTAG */
#define BOARD_INITPINS_JTAG_MOD_SIGNAL                                       MOD   /*!< JTAG signal: MOD */

/* GPIO_AD_B0_01 (number 110), Jtag Tck */
#define BOARD_INITPINS_JTAG_TCK_PERIPHERAL                                  JTAG   /*!< Device name: JTAG */
#define BOARD_INITPINS_JTAG_TCK_SIGNAL                                       TCK   /*!< JTAG signal: TCK */

/* GPIO_AD_B0_03 (number 108), Jtag Tdi */
#define BOARD_INITPINS_JTAG_TDI_PERIPHERAL                                  JTAG   /*!< Device name: JTAG */
#define BOARD_INITPINS_JTAG_TDI_SIGNAL                                       TDI   /*!< JTAG signal: TDI */

/* GPIO_AD_B0_04 (number 107), Jtag Tdo */
#define BOARD_INITPINS_JTAG_TDO_PERIPHERAL                                  JTAG   /*!< Device name: JTAG */
#define BOARD_INITPINS_JTAG_TDO_SIGNAL                                       TDO   /*!< JTAG signal: TDO */

/* GPIO_AD_B0_00 (number 111), Jtag Tms */
#define BOARD_INITPINS_JTAG_TMS_PERIPHERAL                                  JTAG   /*!< Device name: JTAG */
#define BOARD_INITPINS_JTAG_TMS_SIGNAL                                       TMS   /*!< JTAG signal: TMS */

/* GPIO_AD_B0_05 (number 106), Jtag Trstb */
#define BOARD_INITPINS_JTAG_TRSTB_PERIPHERAL                                JTAG   /*!< Device name: JTAG */
#define BOARD_INITPINS_JTAG_TRSTB_SIGNAL                                   TRSTB   /*!< JTAG signal: TRSTB */

/* GPIO_EMC_14 (number 1), Weigher Clk */
#define BOARD_INITPINS_WEIGHER_CLK_PERIPHERAL                               PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPINS_WEIGHER_CLK_SIGNAL                                    EXT   /*!< PWM1 signal: EXT */
#define BOARD_INITPINS_WEIGHER_CLK_CHANNEL                                    A0   /*!< PWM1 EXT channel: A0 */

