swiftat-itwfeg/UnifiedGTXproRT1024/docs/design/board/pin_mux.h
/* GPIO_SD_B0_03 (number 45), Serial Spi CS */
#define BOARD_INITPINS_SERIAL_SPI_CS_PERIPHERAL                           LPSPI1   /*!< Device name: LPSPI1 */
#define BOARD_INITPINS_SERIAL_SPI_CS_SIGNAL                                 PCS0   /*!< LPSPI1 signal: PCS0 */

/* GPIO_SD_B0_02 (number 46), Serial Spi CLK */
#define BOARD_INITPINS_SERIAL_SPI_CLK_PERIPHERAL                          LPSPI1   /*!< Device name: LPSPI1 */
#define BOARD_INITPINS_SERIAL_SPI_CLK_SIGNAL                                 SCK   /*!< LPSPI1 signal: SCK */

/* GPIO_SD_B0_05 (number 42), Serial Spi MISO */
#define BOARD_INITPINS_SERIAL_SPI_MISO_PERIPHERAL                         LPSPI1   /*!< Device name: LPSPI1 */
#define BOARD_INITPINS_SERIAL_SPI_MISO_SIGNAL                                SDI   /*!< LPSPI1 signal: SDI */

/* GPIO_SD_B0_04 (number 43), Serial Spi MOSI */
#define BOARD_INITPINS_SERIAL_SPI_MOSI_PERIPHERAL                         LPSPI1   /*!< Device name: LPSPI1 */
#define BOARD_INITPINS_SERIAL_SPI_MOSI_SIGNAL                                SDO   /*!< LPSPI1 signal: SDO */

/* GPIO_EMC_11 (number 4), Weigher Spi CS */
#define BOARD_INITPINS_WEIGHER_SPI_CS_PERIPHERAL                          LPSPI2   /*!< Device name: LPSPI2 */
#define BOARD_INITPINS_WEIGHER_SPI_CS_SIGNAL                                PCS0   /*!< LPSPI2 signal: PCS0 */

/* GPIO_EMC_10 (number 7), Weigher Spi CLK */
#define BOARD_INITPINS_WEIGHER_SPI_CLK_PERIPHERAL                         LPSPI2   /*!< Device name: LPSPI2 */
#define BOARD_INITPINS_WEIGHER_SPI_CLK_SIGNAL                                SCK   /*!< LPSPI2 signal: SCK */

/* GPIO_EMC_13 (number 2), Weigher Spi MISO */
#define BOARD_INITPINS_WEIGHER_SPI_MISO_PERIPHERAL                        LPSPI2   /*!< Device name: LPSPI2 */
#define BOARD_INITPINS_WEIGHER_SPI_MISO_SIGNAL                               SDI   /*!< LPSPI2 signal: SDI */

/* GPIO_EMC_12 (number 3), Weigher Spi MOSI */
#define BOARD_INITPINS_WEIGHER_SPI_MOSI_PERIPHERAL                        LPSPI2   /*!< Device name: LPSPI2 */
#define BOARD_INITPINS_WEIGHER_SPI_MOSI_SIGNAL                               SDO   /*!< LPSPI2 signal: SDO */

/* GPIO_AD_B1_14 (number 75), Accel Spi MOSI */
#define BOARD_INITPINS_ACCEL_SPI_MOSI_PERIPHERAL                          LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITPINS_ACCEL_SPI_MOSI_SIGNAL                                 SDO   /*!< LPSPI3 signal: SDO */

/* GPIO_AD_B1_15 (number 74), Accel Spi MISO */
#define BOARD_INITPINS_ACCEL_SPI_MISO_PERIPHERAL                          LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITPINS_ACCEL_SPI_MISO_SIGNAL                                 SDI   /*!< LPSPI3 signal: SDI */

/* GPIO_EMC_34 (number 122), Print Head Data */
#define BOARD_INITPINS_PRINT_HEAD_DATA_PERIPHERAL                         LPSPI4   /*!< Device name: LPSPI4 */
#define BOARD_INITPINS_PRINT_HEAD_DATA_SIGNAL                                SDO   /*!< LPSPI4 signal: SDO */

/* GPIO_EMC_35 (number 121), Unused */
#define BOARD_INITPINS_UNUSED_PERIPHERAL                                  LPSPI4   /*!< Device name: LPSPI4 */
#define BOARD_INITPINS_UNUSED_SIGNAL                                         SDI   /*!< LPSPI4 signal: SDI */

/* GPIO_EMC_32 (number 124), Print Head CLK */
#define BOARD_INITPINS_PRINT_HEAD_CLK_PERIPHERAL                          LPSPI4   /*!< Device name: LPSPI4 */
#define BOARD_INITPINS_PRINT_HEAD_CLK_SIGNAL                                 SCK   /*!< LPSPI4 signal: SCK */

/* GPIO_EMC_39 (number 117), Usb OC */
#define BOARD_INITPINS_USB_OC_PERIPHERAL                                     USB   /*!< Device name: USB */
#define BOARD_INITPINS_USB_OC_SIGNAL                                 usb_otg1_oc   /*!< USB signal: usb_otg1_oc */

/* GPIO_EMC_41 (number 115), Usb Pwr */
#define BOARD_INITPINS_USB_PWR_PERIPHERAL                                    USB   /*!< Device name: USB */
#define BOARD_INITPINS_USB_PWR_SIGNAL                               usb_otg1_pwr   /*!< USB signal: usb_otg1_pwr */

/* GPIO_EMC_40 (number 116), Usb Id */
#define BOARD_INITPINS_USB_ID_PERIPHERAL                                     USB   /*!< Device name: USB */
#define BOARD_INITPINS_USB_ID_SIGNAL                                 usb_otg1_id   /*!< USB signal: usb_otg1_id */

/* GPIO_AD_B1_12 (number 78), Accel Spi Clk */
#define BOARD_INITPINS_ACCEL_SPI_CLK_PERIPHERAL                           LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITPINS_ACCEL_SPI_CLK_SIGNAL                                  SCK   /*!< LPSPI3 signal: SCK */

/* GPIO_AD_B1_13 (number 76), Accel Spi CS */
#define BOARD_INITPINS_ACCEL_SPI_CS_PERIPHERAL                            LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITPINS_ACCEL_SPI_CS_SIGNAL                                  PCS0   /*!< LPSPI3 signal: PCS0 */

/* GPIO_AD_B0_07 (number 101), Cutter Uart Rx */
#define BOARD_INITPINS_CUTTER_UART_RX_PERIPHERAL                         LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_CUTTER_UART_RX_SIGNAL                                  RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_06 (number 105), Cutter Uart Tx */
#define BOARD_INITPINS_CUTTER_UART_TX_PERIPHERAL                         LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_CUTTER_UART_TX_SIGNAL                                  TX   /*!< LPUART1 signal: TX */

/* GPIO_EMC_23 (number 133), Debug Uart Rx */
#define BOARD_INITPINS_DEBUG_UART_RX_PERIPHERAL                          LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_DEBUG_UART_RX_SIGNAL                                   RX   /*!< LPUART2 signal: RX */

/* GPIO_EMC_22 (number 136), Debug Uart Tx */
#define BOARD_INITPINS_DEBUG_UART_TX_PERIPHERAL                          LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_DEBUG_UART_TX_SIGNAL                                   TX   /*!< LPUART2 signal: TX */

/* GPIO_EMC_02 (number 16), Pwm 5/25 Clk */
#define BOARD_INITPINS_PWM_5_25_CLK_PERIPHERAL                            LPI2C1   /*!< Device name: LPI2C1 */
#define BOARD_INITPINS_PWM_5_25_CLK_SIGNAL                                   SCL   /*!< LPI2C1 signal: SCL */

