swiftat-itwfeg/UnifiedGTXproRT1024/docs/design/board/pin_mux.h
/* GPIO_EMC_03 (number 15), Pwm 5/25 Data */
#define BOARD_INITPINS_PWM_5_25_DATA_PERIPHERAL                           LPI2C1   /*!< Device name: LPI2C1 */
#define BOARD_INITPINS_PWM_5_25_DATA_SIGNAL                                  SDA   /*!< LPI2C1 signal: SDA */

/* GPIO_EMC_00 (number 18), Label Taken */
#define BOARD_INITPINS_LABEL_TAKEN_GPIO                                    GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LABEL_TAKEN_PORT                                    GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_LABEL_TAKEN_PIN                                        0U   /*!< GPIO2 pin index: 0 */

/* GPIO_EMC_01 (number 17), Print Head Detect */
#define BOARD_INITPINS_PRINT_HEAD_DETECT_GPIO                              GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_DETECT_PORT                              GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_DETECT_PIN                                  1U   /*!< GPIO2 pin index: 1 */

/* GPIO_EMC_04 (number 14), Print Head Id0 */
#define BOARD_INITPINS_PRINT_HEAD_ID0_GPIO                                 GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_ID0_PORT                                 GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_ID0_PIN                                     4U   /*!< GPIO2 pin index: 4 */

/* GPIO_EMC_05 (number 13), Print Head Id1 */
#define BOARD_INITPINS_PRINT_HEAD_ID1_GPIO                                 GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_ID1_PORT                                 GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_ID1_PIN                                     5U   /*!< GPIO2 pin index: 5 */

/* GPIO_EMC_06 (number 12), Print Head Id2 */
#define BOARD_INITPINS_PRINT_HEAD_ID2_GPIO                                 GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_ID2_PORT                                 GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_ID2_PIN                                     6U   /*!< GPIO2 pin index: 6 */

/* GPIO_EMC_07 (number 10), Print Head Strobe EN */
#define BOARD_INITPINS_PRINT_HEAD_STROBE_EN_GPIO                           GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_STROBE_EN_PORT                           GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_STROBE_EN_PIN                               7U   /*!< GPIO2 pin index: 7 */

/* GPIO_EMC_08 (number 9), Print Head Latch */
#define BOARD_INITPINS_PRINT_HEAD_LATCH_GPIO                               GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_LATCH_PORT                               GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_LATCH_PIN                                   8U   /*!< GPIO2 pin index: 8 */

/* GPIO_EMC_09 (number 8), Print Head Strobe */
#define BOARD_INITPINS_PRINT_HEAD_STROBE_GPIO                              GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_STROBE_PORT                              GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_STROBE_PIN                                  9U   /*!< GPIO2 pin index: 9 */

/* GPIO_EMC_15 (number 143), Print Head Pwr EN */
#define BOARD_INITPINS_PRINT_HEAD_PWR_EN_GPIO                              GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_PWR_EN_PORT                              GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_PRINT_HEAD_PWR_EN_PIN                                 15U   /*!< GPIO2 pin index: 15 */

/* GPIO_SD_B1_00 (number 33), Main Stepper Step */
#define BOARD_INITPINS_MAIN_STEPPER_STEP_GPIO                              GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_STEP_PORT                              GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_STEP_PIN                                 20U   /*!< GPIO3 pin index: 20 */

/* GPIO_SD_B1_01 (number 32), Main Stepper Dir */
#define BOARD_INITPINS_MAIN_STEPPER_DIR_GPIO                               GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_DIR_PORT                               GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_DIR_PIN                                  21U   /*!< GPIO3 pin index: 21 */

/* GPIO_SD_B1_02 (number 30), Main Stepper EN */
#define BOARD_INITPINS_MAIN_STEPPER_EN_GPIO                                GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_EN_PORT                                GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_EN_PIN                                   22U   /*!< GPIO3 pin index: 22 */

/* GPIO_SD_B1_03 (number 28), Main Stepper Rst */
#define BOARD_INITPINS_MAIN_STEPPER_RST_GPIO                               GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_RST_PORT                               GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_RST_PIN                                  23U   /*!< GPIO3 pin index: 23 */

/* GPIO_SD_B1_04 (number 27), Main Stepper MS1 */
#define BOARD_INITPINS_MAIN_STEPPER_MS1_GPIO                               GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_MS1_PORT                               GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_MS1_PIN                                  24U   /*!< GPIO3 pin index: 24 */

/* GPIO_SD_B1_05 (number 26), Main Stepper MS2 */
#define BOARD_INITPINS_MAIN_STEPPER_MS2_GPIO                               GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_MS2_PORT                               GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_MAIN_STEPPER_MS2_PIN                                  25U   /*!< GPIO3 pin index: 25 */

/* GPIO_SD_B1_06 (number 25), TakeUp Stepper Step */
#define BOARD_INITPINS_TAKEUP_STEPPER_STEP_GPIO                            GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_STEP_PORT                            GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_STEP_PIN                               26U   /*!< GPIO3 pin index: 26 */

/* GPIO_SD_B1_07 (number 24), TakeUp Stepper Dir */
#define BOARD_INITPINS_TAKEUP_STEPPER_DIR_GPIO                             GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_DIR_PORT                             GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_DIR_PIN                                27U   /*!< GPIO3 pin index: 27 */

/* GPIO_SD_B1_08 (number 23), TakeUp Stepper EN */
#define BOARD_INITPINS_TAKEUP_STEPPER_EN_GPIO                              GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_EN_PORT                              GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_EN_PIN                                 28U   /*!< GPIO3 pin index: 28 */

/* GPIO_SD_B1_09 (number 22), TakeUp Stepper Rst */
#define BOARD_INITPINS_TAKEUP_STEPPER_RST_GPIO                             GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_RST_PORT                             GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_RST_PIN                                29U   /*!< GPIO3 pin index: 29 */

/* GPIO_SD_B1_11 (number 19), TakeUp Stepper MS2 */
#define BOARD_INITPINS_TAKEUP_STEPPER_MS2_GPIO                             GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_MS2_PORT                             GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_MS2_PIN                                31U   /*!< GPIO3 pin index: 31 */

/* GPIO_SD_B1_10 (number 21), TakeUp Stepper MS1 */
#define BOARD_INITPINS_TAKEUP_STEPPER_MS1_GPIO                             GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_MS1_PORT                             GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_TAKEUP_STEPPER_MS1_PIN                                30U   /*!< GPIO3 pin index: 30 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
